package kanaconv

import (
	"strings"
)

var hiragana2katakana = strings.NewReplacer(
	"が", "ガ", "ぎ", "ギ", "ぐ", "グ", "げ", "ゲ", "ご", "ゴ",
	"ざ", "ザ", "じ", "ジ", "ず", "ズ", "ぜ", "ゼ", "ぞ", "ゾ",
	"だ", "ダ", "ぢ", "ヂ", "づ", "ヅ", "で", "デ", "ど", "ド",
	"ば", "バ", "び", "ビ", "ぶ", "ブ", "べ", "ベ", "ぼ", "ボ",
	"ぱ", "パ", "ぴ", "ピ", "ぷ", "プ", "ぺ", "ペ", "ぽ", "ポ",
	"ゔ", "ヴ",
	"あ", "ア", "い", "イ", "う", "ウ", "え", "エ", "お", "オ",
	"か", "カ", "き", "キ", "く", "ク", "け", "ケ", "こ", "コ",
	"さ", "サ", "し", "シ", "す", "ス", "せ", "セ", "そ", "ソ",
	"た", "タ", "ち", "チ", "つ", "ツ", "て", "テ", "と", "ト",
	"な", "ナ", "に", "ニ", "ぬ", "ヌ", "ね", "ネ", "の", "ノ",
	"は", "ハ", "ひ", "ヒ", "ふ", "フ", "へ", "ヘ", "ほ", "ホ",
	"ま", "マ", "み", "ミ", "む", "ム", "め", "メ", "も", "モ",
	"や", "ヤ", "ゆ", "ユ", "よ", "ヨ",
	"ら", "ラ", "り", "リ", "る", "ル", "れ", "レ", "ろ", "ロ",
	"わ", "ワ", "を", "ヲ", "ん", "ン",
	"ぁ", "ァ", "ぃ", "ィ", "ぅ", "ゥ", "ぇ", "ェ", "ぉ", "ォ",
	"っ", "ッ", "ゃ", "ャ", "ゅ", "ュ", "ょ", "ョ",
)

var katakana2hiragana = strings.NewReplacer(
	"ガ", "が", "ギ", "ぎ", "グ", "ぐ", "ゲ", "げ", "ゴ", "ご",
	"ザ", "ざ", "ジ", "じ", "ズ", "ず", "ゼ", "ぜ", "ゾ", "ぞ",
	"ダ", "だ", "ヂ", "ぢ", "ヅ", "づ", "デ", "で", "ド", "ど",
	"バ", "ば", "ビ", "び", "ブ", "ぶ", "ベ", "べ", "ボ", "ぼ",
	"パ", "ぱ", "ピ", "ぴ", "プ", "ぷ", "ペ", "ぺ", "ポ", "ぽ",
	"ヴ", "ゔ",
	"ア", "あ", "イ", "い", "ウ", "う", "エ", "え", "オ", "お",
	"カ", "か", "キ", "き", "ク", "く", "ケ", "け", "コ", "こ",
	"サ", "さ", "シ", "し", "ス", "す", "セ", "せ", "ソ", "そ",
	"タ", "た", "チ", "ち", "ツ", "つ", "テ", "て", "ト", "と",
	"ナ", "な", "ニ", "に", "ヌ", "ぬ", "ネ", "ね", "ノ", "の",
	"ハ", "は", "ヒ", "ひ", "フ", "ふ", "ヘ", "へ", "ホ", "ほ",
	"マ", "ま", "ミ", "み", "ム", "む", "メ", "め", "モ", "も",
	"ヤ", "や", "ユ", "ゆ", "ヨ", "よ",
	"ラ", "ら", "リ", "り", "ル", "る", "レ", "れ", "ロ", "ろ",
	"ワ", "わ", "ヲ", "を", "ン", "ん",
	"ァ", "ぁ", "ィ", "ぃ", "ゥ", "ぅ", "ェ", "ぇ", "ォ", "ぉ",
	"ッ", "っ", "ャ", "ゃ", "ュ", "ゅ", "ョ", "ょ",
)

var hankaku2zenkaku = strings.NewReplacer(
	"0", "０", "1", "１", "2", "２", "3", "３", "4", "４",
	"5", "５", "6", "６", "7", "７", "8", "８", "9", "９",
	"ｶﾞ", "ガ", "ｷﾞ", "ギ", "ｸﾞ", "グ", "ｹﾞ", "ゲ", "ｺﾞ", "ゴ",
	"ｻﾞ", "ザ", "ｼﾞ", "ジ", "ｽﾞ", "ズ", "ｾﾞ", "ゼ", "ｿﾞ", "ゾ",
	"ﾀﾞ", "ダ", "ﾁﾞ", "ヂ", "ﾂﾞ", "ヅ", "ﾃﾞ", "デ", "ﾄﾞ", "ド",
	"ﾊﾞ", "バ", "ﾋﾞ", "ビ", "ﾌﾞ", "ブ", "ﾍﾞ", "ベ", "ﾎﾞ", "ボ",
	"ﾊﾟ", "パ", "ﾋﾟ", "ピ", "ﾌﾟ", "プ", "ﾍﾟ", "ペ", "ﾎﾟ", "ポ",
	"ｳﾞ", "ヴ", "ﾜﾞ", "ヷ", "ｦﾞ", "ヺ",
	"ｱ", "ア", "ｲ", "イ", "ｳ", "ウ", "ｴ", "エ", "ｵ", "オ",
	"ｶ", "カ", "ｷ", "キ", "ｸ", "ク", "ｹ", "ケ", "ｺ", "コ",
	"ｻ", "サ", "ｼ", "シ", "ｽ", "ス", "ｾ", "セ", "ｿ", "ソ",
	"ﾀ", "タ", "ﾁ", "チ", "ﾂ", "ツ", "ﾃ", "テ", "ﾄ", "ト",
	"ﾅ", "ナ", "ﾆ", "ニ", "ﾇ", "ヌ", "ﾈ", "ネ", "ﾉ", "ノ",
	"ﾊ", "ハ", "ﾋ", "ヒ", "ﾌ", "フ", "ﾍ", "ヘ", "ﾎ", "ホ",
	"ﾏ", "マ", "ﾐ", "ミ", "ﾑ", "ム", "ﾒ", "メ", "ﾓ", "モ",
	"ﾔ", "ヤ", "ﾕ", "ユ", "ﾖ", "ヨ",
	"ﾗ", "ラ", "ﾘ", "リ", "ﾙ", "ル", "ﾚ", "レ", "ﾛ", "ロ",
	"ﾜ", "ワ", "ｦ", "ヲ", "ﾝ", "ン",
	"ｧ", "ァ", "ｨ", "ィ", "ｩ", "ゥ", "ｪ", "ェ", "ｫ", "ォ",
	"ｯ", "ッ", "ｬ", "ャ", "ｭ", "ュ", "ｮ", "ョ",
	"｡", "。", "､", "、", "ｰ", "ー", "｢", "「", "｣", "」", "･", "・",
	" ", "　",
)

var zenkaku2hankaku = strings.NewReplacer(
	"０", "0", "１", "1", "２", "2", "３", "3", "４", "4",
	"５", "5", "６", "6", "７", "7", "８", "8", "９", "9",
	"ガ", "ｶﾞ", "ギ", "ｷﾞ", "グ", "ｸﾞ", "ゲ", "ｹﾞ", "ゴ", "ｺﾞ",
	"ザ", "ｻﾞ", "ジ", "ｼﾞ", "ズ", "ｽﾞ", "ゼ", "ｾﾞ", "ゾ", "ｿﾞ",
	"ダ", "ﾀﾞ", "ヂ", "ﾁﾞ", "ヅ", "ﾂﾞ", "デ", "ﾃﾞ", "ド", "ﾄﾞ",
	"バ", "ﾊﾞ", "ビ", "ﾋﾞ", "ブ", "ﾌﾞ", "ベ", "ﾍﾞ", "ボ", "ﾎﾞ",
	"パ", "ﾊﾟ", "ピ", "ﾋﾟ", "プ", "ﾌﾟ", "ペ", "ﾍﾟ", "ポ", "ﾎﾟ",
	"ヴ", "ｳﾞ", "ヷ", "ﾜﾞ", "ヺ", "ｦﾞ",
	"ア", "ｱ", "イ", "ｲ", "ウ", "ｳ", "エ", "ｴ", "オ", "ｵ",
	"カ", "ｶ", "キ", "ｷ", "ク", "ｸ", "ケ", "ｹ", "コ", "ｺ",
	"サ", "ｻ", "シ", "ｼ", "ス", "ｽ", "セ", "ｾ", "ソ", "ｿ",
	"タ", "ﾀ", "チ", "ﾁ", "ツ", "ﾂ", "テ", "ﾃ", "ト", "ﾄ",
	"ナ", "ﾅ", "ニ", "ﾆ", "ヌ", "ﾇ", "ネ", "ﾈ", "ノ", "ﾉ",
	"ハ", "ﾊ", "ヒ", "ﾋ", "フ", "ﾌ", "ヘ", "ﾍ", "ホ", "ﾎ",
	"マ", "ﾏ", "ミ", "ﾐ", "ム", "ﾑ", "メ", "ﾒ", "モ", "ﾓ",
	"ヤ", "ﾔ", "ユ", "ﾕ", "ヨ", "ﾖ",
	"ラ", "ﾗ", "リ", "ﾘ", "ル", "ﾙ", "レ", "ﾚ", "ロ", "ﾛ",
	"ワ", "ﾜ", "ヲ", "ｦ", "ン", "ﾝ",
	"ァ", "ｧ", "ィ", "ｨ", "ゥ", "ｩ", "ェ", "ｪ", "ォ", "ｫ",
	"ッ", "ｯ", "ャ", "ｬ", "ュ", "ｭ", "ョ", "ｮ",
	"。", "｡", "、", "､", "ー", "ｰ", "「", "｢", "」", "｣", "・", "･",
	"　", " ",
)

var smart = strings.NewReplacer(
	"ａ", "a", "ｂ", "b", "ｃ", "c", "ｄ", "d", "ｅ", "e", "ｆ", "f",
	"ｇ", "g", "ｈ", "h", "ｉ", "i", "ｊ", "j", "ｋ", "k", "ｌ", "l",
	"ｍ", "m", "ｎ", "n", "ｏ", "o", "ｐ", "p", "ｑ", "q", "ｒ", "r",
	"ｓ", "s", "ｔ", "t", "ｕ", "u", "ｖ", "v", "ｗ", "w", "ｘ", "x",
	"ｙ", "y", "ｚ", "z",
	"Ａ", "A", "Ｂ", "B", "Ｃ", "C", "Ｄ", "D", "Ｅ", "E", "Ｆ", "F",
	"Ｇ", "G", "Ｈ", "H", "Ｉ", "I", "Ｊ", "J", "Ｋ", "K", "Ｌ", "L",
	"Ｍ", "M", "Ｎ", "N", "Ｏ", "O", "Ｐ", "P", "Ｑ", "Q", "Ｒ", "R",
	"Ｓ", "S", "Ｔ", "T", "Ｕ", "U", "Ｖ", "V", "Ｗ", "W", "Ｘ", "X",
	"Ｙ", "Y", "Ｚ", "Z",
	"０", "0", "１", "1", "２", "2", "３", "3", "４", "4",
	"５", "5", "６", "6", "７", "7", "８", "8", "９", "9",
	"ｶﾞ", "ガ", "ｷﾞ", "ギ", "ｸﾞ", "グ", "ｹﾞ", "ゲ", "ｺﾞ", "ゴ",
	"ｻﾞ", "ザ", "ｼﾞ", "ジ", "ｽﾞ", "ズ", "ｾﾞ", "ゼ", "ｿﾞ", "ゾ",
	"ﾀﾞ", "ダ", "ﾁﾞ", "ヂ", "ﾂﾞ", "ヅ", "ﾃﾞ", "デ", "ﾄﾞ", "ド",
	"ﾊﾞ", "バ", "ﾋﾞ", "ビ", "ﾌﾞ", "ブ", "ﾍﾞ", "ベ", "ﾎﾞ", "ボ",
	"ﾊﾟ", "パ", "ﾋﾟ", "ピ", "ﾌﾟ", "プ", "ﾍﾟ", "ペ", "ﾎﾟ", "ポ",
	"ｳﾞ", "ヴ", "ﾜﾞ", "ヷ", "ｦﾞ", "ヺ",
	"ｱ", "ア", "ｲ", "イ", "ｳ", "ウ", "ｴ", "エ", "ｵ", "オ",
	"ｶ", "カ", "ｷ", "キ", "ｸ", "ク", "ｹ", "ケ", "ｺ", "コ",
	"ｻ", "サ", "ｼ", "シ", "ｽ", "ス", "ｾ", "セ", "ｿ", "ソ",
	"ﾀ", "タ", "ﾁ", "チ", "ﾂ", "ツ", "ﾃ", "テ", "ﾄ", "ト",
	"ﾅ", "ナ", "ﾆ", "ニ", "ﾇ", "ヌ", "ﾈ", "ネ", "ﾉ", "ノ",
	"ﾊ", "ハ", "ﾋ", "ヒ", "ﾌ", "フ", "ﾍ", "ヘ", "ﾎ", "ホ",
	"ﾏ", "マ", "ﾐ", "ミ", "ﾑ", "ム", "ﾒ", "メ", "ﾓ", "モ",
	"ﾔ", "ヤ", "ﾕ", "ユ", "ﾖ", "ヨ",
	"ﾗ", "ラ", "ﾘ", "リ", "ﾙ", "ル", "ﾚ", "レ", "ﾛ", "ロ",
	"ﾜ", "ワ", "ｦ", "ヲ", "ﾝ", "ン",
	"ｧ", "ァ", "ｨ", "ィ", "ｩ", "ゥ", "ｪ", "ェ", "ｫ", "ォ",
	"ｯ", "ッ", "ｬ", "ャ", "ｭ", "ュ", "ｮ", "ョ",
	"｡", "。", "､", "、", "ｰ", "ー", "｢", "「", "｣", "」", "･", "・",
	"－", "-", "−", "-", "‐", "-", "＋", "+", "＝", "=", "，", ",", "％", "%", "＊", "*",
	"（", "(", "）", ")", "!", "！", "”", `"`, "＃", "#", "＄", "$", "％", "%",
	"＆", "&", "’", "'", "　", " ",
)

// HiraganaToKatakana はひらがなをカタカナに変換する
func HiraganaToKatakana(s string) string {
	return hiragana2katakana.Replace(s)
}

// KatakanaToHiragana はカタカナをひらがなに変換する
func KatakanaToHiragana(s string) string {
	return katakana2hiragana.Replace(s)
}

// ZenkakuToHankaku は全角文字を半角に変換する
func ZenkakuToHankaku(s string) string {
	return zenkaku2hankaku.Replace(s)
}

// HankakuToZenkaku は半角文字を全角に変換する
func HankakuToZenkaku(s string) string {
	return hankaku2zenkaku.Replace(s)
}

// SmartConv はカタカナは全角に、英数字記号は半角に統一する
func SmartConv(s string) string {
	return smart.Replace(s)
}
